from transformers import AutoTokenizer, AutoModel
from model import AdvancedMultiLabelMLP
from threading import Thread

import joblib as jb
import numpy as np
import pymorphy3
import string
import torch
import traceback
import json
import time
import pika

DEVICE = torch.device("cuda" if torch.cuda.is_available() else "cpu")

RUBERT_NAME = "./rubert-tiny2"
tokenizer = AutoTokenizer.from_pretrained(RUBERT_NAME)
rubert_model = AutoModel.from_pretrained(RUBERT_NAME).to(DEVICE)
rubert_model.eval()

INPUT_DIM = 312
HIDDEN_DIM = 512
NUM_LABELS = 13

mlp_model = AdvancedMultiLabelMLP(input_dim=INPUT_DIM, num_labels=NUM_LABELS, hidden_dim=HIDDEN_DIM).to(DEVICE)
mlp_model.load_state_dict(torch.load("mlp_model.pth", map_location=DEVICE))
mlp_model.eval()

binary_clf = jb.load("./relations_pipeline.pkl")

thresholds = jb.load("thresholds.pkl") # словарь категория -> порог
mlb = jb.load("mlb.pkl")               # обученный MultiLabelBinarizer
RELATIONS_CLASS = "Отношения"
if not RELATIONS_CLASS in mlb.classes_:
    raise ValueError("Label 'Отношения' doesn't exist")

RELATIONS_IDX = np.where(mlb.classes_ == RELATIONS_CLASS)[0][0]

class LabelPredictor:
    morph = pymorphy3.MorphAnalyzer()
    translator = str.maketrans('', '', string.punctuation + string.digits)
    russian_stopwords = ['и', 'в', 'во', 'не', 'что', 'он', 'на', 'я', 'с', 'со', 'как', 'а', 'то', 'все', 'она', 'так', 'его', 'но', 'да', 'ты', 'к', 'у', 'же', 'вы', 'за', 'бы', 'по', 'только', 'ее', 'мне', 'было', 'вот', 'от', 'меня', 'еще', 'нет', 'о', 'из', 'ему', 'теперь', 'когда', 'даже', 'ну', 'вдруг', 'ли', 'если', 'уже', 'или', 'ни', 'быть', 'был', 'него', 'до', 'вас', 'нибудь', 'опять', 'уж', 'вам', 'ведь', 'там', 'потом', 'себя', 'ничего', 'ей', 'может', 'они', 'тут', 'где', 'есть', 'надо', 'ней', 'для', 'мы', 'тебя', 'их', 'чем', 'была', 'сам', 'чтоб', 'без', 'будто', 'чего', 'раз', 'тоже', 'себе', 'под', 'будет', 'ж', 'тогда', 'кто', 'этот', 'того', 'потому', 'этого', 'какой', 'совсем', 'ним', 'здесь', 'этом', 'один', 'почти', 'мой', 'тем', 'чтобы', 'нее', 'сейчас', 'были', 'куда', 'зачем', 'всех', 'никогда', 'можно', 'при', 'наконец', 'два', 'об', 'другой', 'хоть', 'после', 'над', 'больше', 'тот', 'через', 'эти', 'нас', 'про', 'всего', 'них', 'какая', 'много', 'разве', 'три', 'эту', 'моя', 'впрочем', 'хорошо', 'свою', 'этой', 'перед', 'иногда', 'лучше', 'чуть', 'том', 'нельзя', 'такой', 'им', 'более', 'всегда', 'конечно', 'всю', 'между']
    outdoor_words = {"парк", "улица", "пикник", "пляж", "поход", "велосипед", "прогулка", "набережная", "велопрогулка", "зоопарк", "ботанический", "каток", "бассейн", "рыбалка", "аэродинамика", "аэропорт", "гараж", "автомойка", "автосалон", "автошкола", "вокзал", "кинотеатр", "музей", "выставка", "кафе", "кино", "библиотека", "театр", "концерт", "фестивIVAL", "экскурсия", "галерея", "галерея", "митинг", "демонстрация", "праздник", "празднование", "ярмарка", "базар", "рынок", "парковка", "автобус", "поезд", "самолёт", "такси", "переезд", "путешествие", "туризм", "отель", "гостиница", "лагерь", "палатка", "кемпинг", "альпинизм", "скалолазание", "сплав", "катание", "лыжи", "сноуборд", "коньки", "хоккей", "футбол", "баскетбол", "волейбол", "теннис", "бег", "марафон", "соревнование", "тренировка", "спорт", "арена", "стадион", "поле", "площадка", "аллея", "сад", "огород", "лес", "гора", "озеро", "река", "водопад", "море", "остров", "пещера", "каньон", "вершина", "тропа", "дорога", "шоссе", "улица", "переулок", "площадь", "бульвар", "набережная", "берег", "мыс", "залив", "бухта", "скала", "ущелье", "фонтан", "сквер", "роса", "гроза", "дождь", "снег", "ветер", "солнце", "лужа", "грядка", "теплица", "рассада", "саженец", "посадка", "полив", "прополка", "уборка", "сбор", "урожай", "компост", "мусор", "переработка", "ландшафт", "озеленение", "благоустройство", "благоустроить", "посадить", "высадить", "выгулять", "погулять", "сходить", "поехать", "отправиться", "выехать", "приехать", "посетить", "обойти", "осмотреть", "исследовать", "наблюдать", "фотографировать", "сфотографировать", "рисовать", "писать", "лепить", "танцевать", "петь", "играть", "гулять"}
    indoor_words = {"офис", "дом", "квартира", "домашний", "домик", "комната", "кухня", "ванная", "ванна", "туалет", "санузел", "гостиная", "подвал", "балкон", "лоджия", "коридор", "прихожая", "столовая", "спальня", "гардероб", "кладовка", "мастерская", "лаборатория", "клиника", "больница", "поликлиника", "аптека", "университет", "вуза", "школа", "садик", "детский", "кинотеатр", "кино", "музей", "галерея", "библиотека", "театр", "концерт", "кафе", "ресторан", "бар", "антикафе", "ателье", "парикмахерская", "салон", "офисный", "конференц-зал", "аудитория", "лекция", "семинар", "занятие", "урок", "вебинар", "онлайн", "видеоконференция", "звонок", "созвон", "совещание", "встреча", "планёрка", "брифинг", "интервью", "собеседование", "репетиция", "репетитор", "тренажёрный", "спортзал", "фитнес", "бассейн", "сауна", "баня", "сарай", "гараж", "автомойка", "автосалон", "автошкола", "гостиница", "отель", "хостел", "общежитие", "пенсионат", "санаторий", "лагерь", "палатка", "дача", "беседка", "магазин", "супермаркет", "рынок", "ярмарка", "выставка", "павильон", "галерея", "студия", "цех", "завод", "фабрика", "склад", "офисное", "рабочий", "служебный", "лечебный", "медицинский", "стоматология", "хирургия", "рентген", "лабораторный", "учебный", "образовательный", "творческий", "кулинарный", "мастеркласс", "курс", "тренинг", "лекторий", "лекторий", "кабинет", "кабинетный", "институт", "академия", "колледж", "лицей", "гимназия", "интернат", "церковь", "храм", "мечеть", "синагога", "капелла", "диспансер", "роддом", "клиника", "аптека", "лаборатория", "операционный", "палата", "реанимация", "процедурный", "регистратура", "фельдшер", "медсестра", "врач", "терапевт", "хирург", "гинеколог", "офтальмолог", "психиатр", "психолог", "логопед", "невролог", "кардиолог", "ортопед", "травматолог", "уролог", "эндокринолог", "гастроэнтеролог", "пульмонолог", "дерматолог", "аллерголог", "онколог", "радиолог", "анестезиолог", "реаниматолог", "неонатолог", "педиатр", "геронтолог", "нарколог", "токсиколог", "эпидемиолог", "микробиолог", "цитолог", "гистолог", "патоморфолог", "генетик", "иммунолог", "гематолог", "нефролог", "гепатолог", "фтизиатр", "венеролог", "сексолог", "уролог", "андролог", "маммолог", "акушер", "неонатолог", "реабилитолог", "физиотерапевт", "мануальный", "остеопат", "иглотерапевт", "гомеопат", "фитотерапевт", "диетолог", "нутрициолог", "сомнолог", "кардиохирург", "нейрохирург", "пластический", "травматолог-ортопед", "челюстно-лицевой", "офтальмохирург", "урохирург", "торакальный", "абдоминальный", "сосудистый", "эндоваскулярный", "трансплантолог", "онкохирург", "нейроонколог", "геронтолог", "психотерапевт", "клинический", "судебный", "спортивный", "массажист", "косметолог", "дерматокосметолог", "трихолог", "подолог", "стоматолог", "ортодонт", "пародонтолог", "хирург-стоматолог", "имплантолог", "протезист", "гигиенист", "рентгенолог", "томограф", "УЗИ", "эхокардиограф", "электрокардиограф", "спирограф", "электроэнцефалограф", "полисомнограф", "лаборант", "санитар", "водитель", "фельдшер", "дежурный", "дежурка", "дежурство", "дежурный", "дежурка", "дежурство", "дежурный", "дежурка", "дежурство"}

    def transform_to_base_form(self, row: str) -> str:
        row = row.lower().translate(self.translator)
        words = row.split()
        mean_words = [word for word in words if not word in self.russian_stopwords]
        formed_words = [self.morph.parse(word)[0].normal_form for word in mean_words]

        return " ".join(formed_words)

    def is_outside(self, text: str) -> bool:
        t = self.transform_to_base_form(text).split()
        if any(word in self.outdoor_words for word in t):
            return True
        if any(word in self.indoor_words for word in t):
            return False
        return False

    def predict_classes(self, text: str):
        emb = self.get_embedding(text)
        emb_tensor = torch.tensor(emb, dtype=torch.float32).unsqueeze(0).to(DEVICE)

        with torch.no_grad():
            logits = mlp_model(emb_tensor)  # shape: [1, n_classes]
            probs = torch.sigmoid(logits).cpu().numpy().flatten()

        rel_prob = binary_clf.predict_proba([self.transform_to_base_form(text)])[0][1]
        probs[RELATIONS_IDX] = rel_prob

        thld_arr = np.array([thresholds[cls] for cls in mlb.classes_])
        pred_binary = (probs >= thld_arr).astype(int)
        labels = mlb.inverse_transform(pred_binary.reshape(1, -1))[0]

        return list(labels)

    @staticmethod
    def get_embedding(text: str) -> np.ndarray:
        inputs = tokenizer(
            text,
            truncation=True,
            padding=True,
            max_length=128,
            return_tensors="pt"
        ).to(DEVICE)
        with torch.no_grad():
            outputs = rubert_model(**inputs)
        return outputs.last_hidden_state[0, 0].cpu().numpy()

predictor = LabelPredictor()

def process_message(channel, method, properties, body):
    try:
        # 1. Парсинг входного сообщения
        request_data = json.loads(body.decode())
        user_input = request_data["userInput"]

        # 2. Предсказание
        categories = predictor.predict_classes(user_input)
        on_the_street = predictor.is_outside(user_input)

        # 3. Формирование ответа
        response = {
            "categories": categories,
            "onTheStreet": on_the_street
        }

        # 4. Отправка ответа обратно
        channel.basic_publish(
            exchange="",
            routing_key=properties.reply_to,  # очередь отправителя
            properties=pika.BasicProperties(
                correlation_id=properties.correlation_id
            ),
            body=json.dumps(response, ensure_ascii=False)
        )

        # Подтверждение обработки сообщения
        channel.basic_ack(delivery_tag=method.delivery_tag)

    except Exception as e:
        print(f"Ошибка обработки: {e}")
        print(traceback.format_exc())
        channel.basic_nack(delivery_tag=method.delivery_tag, requeue=False)

def start_rabbitmq_listener():
    try:
        time.sleep(10)

        connection = pika.BlockingConnection(
            pika.ConnectionParameters(
                host="rmq",
                port=5672
            )
        )
        channel = connection.channel()

        channel.exchange_declare(exchange="tempus", exchange_type="topic", durable=True)

        result = channel.queue_declare(queue="ml-classification")
        queue_name = result.method.queue

        channel.queue_bind(
            exchange="tempus",
            queue=queue_name,
            routing_key="ml.calculate-categories.command"
        )

        channel.basic_consume(
            queue=queue_name,
            on_message_callback=process_message,
            auto_ack=False
        )

        channel.start_consuming()

    except Exception as e:
        print(f"❌ RabbitMQ listener failed: {e}")
        raise


if __name__ == "__main__":
    rabbit_thread = Thread(target=start_rabbitmq_listener, daemon=True)
    rabbit_thread.start()

    print("🚀 ML Category Service is running. Press Ctrl+C to exit.")

    try:
        while True:
            time.sleep(1)  # чтобы не нагружать CPU
    except KeyboardInterrupt:
        print("\n🛑 Shutting down...")